tutorials/OF-RTM/CRTM_test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (2 0 0)    
    (0 2 0)
    (2 2 0)    
    (0 0 0.03)
    (2 0 0.03)    
    (0 2 0.03)
    (2 2 0.03)    
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (100 100 5) simpleGrading (1 1 1)    
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 1 5 4)            
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 3 7 6)            
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 3 2)            
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 5 7 6)            
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 2 6 4)            
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)            
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
