tutorials/OF-RTM/CRTM_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       139000;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       139500;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       140000;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       150000;
    }
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       160000;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       160500;
    }
)

// ************************************************************************* //
