tutorials/OF-RTM/CRTM_test/constant/turbulenceProperties
/*---------------------------------------------------------------------------------------------------------------------------------------*\
|                                                                                                                                         | 
|    ANSA_VERSION: 13.2.2                                                                                                                 | 
|                                                                                                                                         | 
|    file created by  A N S A  Tue Jul 24 17:35:30 2012                                                                                   | 
|                                                                                                                                         | 
|    Output from: /usrfem/Projects/2_Active/forschung/Diplomarbeiten/12_Unix/Bernath/05_Motorhaube_scirocco/05_motorhaube_scirocco.ansa   | 
|                                                                                                                                         | 
\*---------------------------------------------------------------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format ascii;
	class dictionary;
	location "";
	object turbulenceProperties;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

simulationType laminar;
