tutorials/OF-RTM/CRTM_test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50000
(
(0.0042232749 5.6034296e-07 8.056837e-07)
(0.0073455971 6.6025376e-07 7.5266009e-07)
(0.006593575 -2.5941261e-07 -8.8801592e-07)
(0.0065901613 1.1138108e-06 1.1429154e-06)
(0.0054820622 -8.9346535e-06 -2.7460271e-05)
(0.0070137167 -3.8892502e-05 -0.00011306787)
(0.0077908043 -1.2852007e-05 -3.8191423e-05)
(0.0066894258 4.5191394e-06 4.0810885e-06)
...
)
;

boundaryField
{
    leftWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    rightWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    upperWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
