tutorials/OF-RTM/CRTM_test/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
50000
(
147853.13
134424.66
125152.86
113834.58
101764.31
100161.21
100158.24
100156.64
...
)
;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
500
(
618474.73
618474.19
618474.09
618474.19
618474.73
605071.7
605071.63
605071.6
...
)
;
    }
    rightWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
500
(
618474.8
618474.26
618474.16
618474.26
618474.8
605071.77
605071.7
605071.67
...
)
;
    }
    lowerWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
10000
(
618474.73
618474.27
618474.06
618473.88
618473.76
618473.66
618473.58
618473.51
...
)
;
    }
    upperWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
10000
(
618474.73
618474.27
618474.06
618473.88
618473.76
618473.66
618473.58
618473.51
...
)
;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 100000;
        value           uniform 100000;
    }
}


// ************************************************************************* //
