tutorials/OF-RTM/CRTM_test/0/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
50000
(
293.00068
293.00265
293.00369
293.0044
293.00455
293.00452
293.00445
293.00288
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
293.00104
293.00104
293.00104
293.00104
293.00104
293.00406
293.00406
293.00406
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
293.00104
293.00104
293.00104
293.00104
293.00104
293.00406
293.00406
293.00406
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
293.00104
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 293;
    }
    outlet
    {
        type            calculated;
        value           uniform 293.00022;
    }
}


// ************************************************************************* //
