tutorials/OF-RTM/CRTM_test/0/muFluid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      muFluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1.8e-05;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
0.113
0.113
0.113
0.113
0.113
0.113
0.113
0.113
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
0.113
0.113
0.113
0.113
0.113
0.113
0.113
0.113
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
0.113
0.113
0.113
0.113
0.113
0.113
0.113
0.113
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
0.113
0.113
0.113
0.113
0.113
0.113
0.113
0.113
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.113;
    }
    outlet
    {
        type            calculated;
        value           uniform 1.8e-05;
    }
}


// ************************************************************************* //
