tutorials/OF-RTM/CRTM_test/0/phi.unmapped.unmapped
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "10";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
139000
(
7.9956632e-09
2.6937385e-13
3.267435e-12
7.9949105e-09
1.2531472e-13
6.2738494e-13
7.9949544e-09
4.8009472e-14
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
-7.9992e-09
-7.9992e-09
-7.9992e-09
-7.9992e-09
-7.9992e-09
-7.9992e-09
-7.9992e-09
-7.9992e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
8.1059409e-09
8.1065213e-09
8.1065219e-09
8.1065221e-09
8.106522e-09
8.106522e-09
8.1065221e-09
8.1065221e-09
...
)
;
    }
}


// ************************************************************************* //
