tutorials/OF-RTM/CRTM_test/0/pointMotionUz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            slip;
    }
    rightWall
    {
        type            slip;
    }
    lowerWall
    {
        type            fixedValue;
		value           uniform 0;
    }
    upperWall
    {
		type			fixedValue;		
		value			uniform -5e-5;
    }
    inlet
    {
        type            slip;
    }
    outlet
    {
        type            slip;
    }
}

// ************************************************************************* //
