tutorials/OF-RTM/CRTM_test/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
50000
(
1000
1000
1000
1000
925.30205
82.455919
1.1881622
1.1881496
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
1000
1000
1000
1000
1000
1000
1000
1000
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
1000
1000
1000
1000
1000
1000
1000
1000
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
1000
1000
1000
1000
1000
1000
1000
1000
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
10000
(
1000
1000
1000
1000
1000
1000
1000
1000
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 1000;
    }
    outlet
    {
        type            calculated;
        value           uniform 1.1863022;
    }
}


// ************************************************************************* //
