tutorials/OF-RTM/CRTM_test/0/sourceValue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[-1 1 1 0 0 0 0];

internalField	uniform 0;


boundaryField
{
	inlet
	{
		type	        	zeroGradient;
	}

	
	outlet
	{
		type	        	zeroGradient;
	}

	    leftWall
	    {
		type	        	zeroGradient;
	    }
	    rightWall
	    {
		type	        	zeroGradient;
	    }

	    lowerWall
	    {
		type	        	zeroGradient;
	    }
	    upperWall
	    {
		type	        	zeroGradient;
	    }    
}


// ************************************************************************* //
