tutorials/OF-RTM/CRTM_test/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm log.*
rm -r processor*
rm -r [1-9]*
rm -r 0.*

runApplication blockMesh
runApplication topoSet
runApplication mapFields -sourceTime 'latestTime' ../IRTM_test
mv 0/pointMotionUz.* 0/pointMotionUz
runApplication decomposePar 
runParallel RTMDyMFoam 
runApplication reconstructPar
